app/controllers/api/v1/tests_controller.rb

  def index
    all_tests = Test.all
---
SELECT "tests".* FROM "tests"

  def create
    test = Test.create(test_params)
---
INSERT INTO "tests" ("pri", "question", "team_stages", "appears_day", "frequency", "types", "role", "required", "conditions", "mapping", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def show
    test = Test.find(params[:id])
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    test = Test.find(params[:id])
    test.update(test_params)
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tests" SET "types" = $1, "created_at" = $2, "updated_at" = $3 WHERE "tests"."id" = $4  [["types", "rewr"], ["created_at", "2020-07-14 17:43:55.851267"], ["updated_at", "2020-07-14 17:43:55.851334"], ["id", 1]]

  def destroy
    Test.destroy(params[:id])
---
DELETE FROM "tests" WHERE "tests"."id" = $1  [["id", 1]]

  def get_roles
    all_roles = Role.all
---
SELECT "roles".* FROM "roles"

  def get_mappings
    all_mappings = Mapping.all
---
SELECT "mappings".* FROM "mappings"