app/models/test.rb

	def self.import(file)
		# CSV.foreach(file.path, headers: true) do |row|
		# 	Test.create! row.to_hash
		# end

		CSV.foreach(file.path, headers: true) do |row|

			unless  Role.find_by_name(row[6]).present?
			 Role.create(name: row[6])
			end
			unless  Mapping.find_by_name(row[9]).present?
			 Mapping.create(name: row[9])
			end
            company_hash = Test.new
            company_hash.pri = row[0]
            company_hash.question = row[1]
            company_hash.team_stages = row[2]
            company_hash.appears_day = row[3]
            company_hash.frequency = row[4]
            company_hash.types = row[5]
            company_hash.role = row[6]
            company_hash.required = row[7]
            company_hash.conditions = row[8]
            company_hash.mapping = row[9]
            company_hash.save
---
SELECT "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "Admin"], ["LIMIT", 1]]
INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Admin"], ["created_at", "2020-07-15 06:18:23.100977"], ["updated_at", "2020-07-15 06:18:23.101285"]]
SELECT "mappings".* FROM "mappings" WHERE "mappings"."name" = $1 LIMIT $2  [["name", "Collaboration"], ["LIMIT", 1]]
INSERT INTO "mappings" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Collaboration"], ["created_at", "2020-07-15 06:18:23.234112"], ["updated_at", "2020-07-15 06:18:23.234301"]]
INSERT INTO "tests" ("pri", "question", "team_stages", "appears_day", "frequency", "types", "role", "required", "conditions", "mapping", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"